# Class1

In [4]:
5+10

15

In [6]:
45/5

9.0

In [10]:
7%2

1

In [16]:
type("hi")

str

In [17]:
type("hi123")

str

In [22]:
5**5

3125

In [23]:
import pandas as pd

In [26]:
data = ['jatin', 'raghav', ' nitika','nikhil']

In [27]:
data

['jatin', 'raghav', ' nitika', 'nikhil']

In [30]:
pd.Series(data)

0      jatin
1     raghav
2     nitika
3     nikhil
dtype: object

In [34]:
pd.Series(data, index= ['nanda', 'ahuja','ahuja','ahuja'])

nanda      jatin
ahuja     raghav
ahuja     nitika
ahuja     nikhil
dtype: object

In [40]:
names = {'person1': 'Jatin', 'Person2': ' Raghav'}
pd.Series(names)

person1      Jatin
Person2     Raghav
dtype: object

In [41]:
# an exmple

In [43]:
names1 = pd.Series({'Name': 'Jatin', 'Place': 'Delhi'})

In [45]:
names2 = pd.Series({'Name': 'Raghav', 'Place': 'Gurgaon'})

In [50]:
df = pd.DataFrame([names1, names2], index = ['Person1','Person2'])

In [52]:
df

           Name    Place
Person1   Jatin    Delhi
Person2  Raghav  Gurgaon

In [56]:
df.loc['Person1']

Name     Jatin
Place    Delhi
Name: Person1, dtype: object

In [58]:
df.loc['Person2']

Name      Raghav
Place    Gurgaon
Name: Person2, dtype: object

In [66]:
# Adding an additonal column to the table
df['Contact Details']=[9654836613, 9953260780]

In [62]:
df

           Name    Place  Contact Details
Person1   Jatin    Delhi       9654836613
Person2  Raghav  Gurgaon       9953260780

In [64]:
df['Email ID']=['iamjatinnanda@gmail.com','iamraghav@gmail.com']

In [67]:
df

           Name    Place  Contact Details                 Email ID
Person1   Jatin    Delhi       9654836613  iamjatinnanda@gmail.com
Person2  Raghav  Gurgaon       9953260780      iamraghav@gmail.com

In [73]:
df.rename(columns ={'Name':'FirstName'})

        FirstName    Place  Contact Details                 Email ID
Person1     Jatin    Delhi       9654836613  iamjatinnanda@gmail.com
Person2    Raghav  Gurgaon       9953260780      iamraghav@gmail.com